app/views/changes/_form.html.erb

    <%= f.label :story_id %><br>
   <%= f.collection_select(:story_id,
                            Story.all,
                            :id,
                            :title,
                            { :prompt => true })
---
SELECT `stories`.* FROM `stories`

    <%= f.label :user_id %><br>
   <%= f.collection_select(:user_id,
                            User.all,
                            :id,
                            :name,
                            { :prompt => true })
---
SELECT `users`.* FROM `users`

    <%= f.label :state_from %><br>
  <%= f.collection_select(:state_from_id,
                            State.all,
                            :id,
                            :title,
                            { :prompt => true })
---
SELECT `states`.* FROM `states`