app/controllers/changes_controller.rb

SELECT `changes`.* FROM `changes`   ORDER BY story_id,order
SELECT `states`.* FROM `states`   ORDER BY ´order´
---
  def index
    @changes = Change.order("story_id desc").all

    sfrom = Hash.new
    sto = Hash.new

    @sdiff = Hash.new

    Change.order("story_id, date").all.each do |change|
      timedate = ActiveSupport::TimeZone["Brasilia"].parse(change.date.to_s).to_i

      sfrom[change.story.id.to_s + "-" + change.state_from.order.to_s] = timedate

INSERT INTO `changes` (`created_at`, `date`, `state_from_id`, `state_to_id`, `story_id`, `updated_at`, `user_id`) VALUES ('2014-10-18 18:51:28', '2014-10-18 18:51:00', 1, 2, 1, '2014-10-18 18:51:28', 1)
---
  def create
    @change = Change.new(change_params)

    respond_to do |format|
      if @change.save

UPDATE `changes` SET `date` = '2014-10-20 22:55:00', `updated_at` = '2014-10-18 18:57:17' WHERE `changes`.`id` = 9
---
  def update
    respond_to do |format|
      if @change.update(change_params)

DELETE FROM `changes` WHERE `changes`.`id` = 1
---
  def destroy
    @change.destroy

SELECT  `changes`.* FROM `changes`  WHERE `changes`.`id` = 2 LIMIT 1
---
    def set_change
      @change = Change.find(params[:id])