app/controllers/states_controller.rb

  def index
    @states = State.order("`order`").all
---
SELECT `states`.* FROM `states`   ORDER BY `order`

  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save
---
INSERT INTO `states` (`created_at`, `order`, `title`, `updated_at`) VALUES ('2014-10-18 15:00:47', 1, 'New', '2014-10-18 15:00:47')

  def update
    respond_to do |format|
      if @state.update(state_params)
---
UPDATE `states` SET `title` = 'Developed', `updated_at` = '2014-10-18 19:09:45' WHERE `states`.`id` = 2

    def set_state
      @state = State.find(params[:id])
---
SELECT  `states`.* FROM `states`  WHERE `states`.`id` = 2 LIMIT 1