app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT `stories`.* FROM `stories`

  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`code`, `created_at`, `points`, `title`, `updated_at`) VALUES ('001', '2014-10-18 18:41:07', 12, 'Story 1', '2014-10-18 18:41:07')

    def set_story
      @story = Story.find(params[:id])
---
SELECT  `stories`.* FROM `stories`  WHERE `stories`.`id` = 1 LIMIT 1